package atmBank;


public class Runner {


    public static void main(String[] args) {


    }

    //Реализуйте систему банкомата
    //Объекты:
    //Банкомат
    //Банковская карта
    //Деньги
    //Человек
    //Банковский счет
    //История транзакций

    //Процесс:
    //ЧЕЛОВЕК вставляет КАРТУ в БАНКОМАТ

    //БАНКОМАТ проверяет КАРТУ:
    //правильно ли вставлена КАРТА;
    //правильная ли КАРТА;
    //принимает ли этот тип КАРТЫ (Мастер Кард, Виза, есть ли чип);
    //просроченная или нет;
    //заблокирована или нет (причина);
    //БАНКОМАТ просит ввести пин:
    //проверка пин-кода (после 3х неверных вводов что-то происходит)
    //ЧЕЛОВЕК выбирает услугу:
    //перечисление денег;
    //снятие денег;
    //просмотреть баланс:
    //на экран
    //смс
    //чек
    //получение денег

    //Получение денег из БАНКОМАТА:
    //ЧЕЛОВЕК вводит сумму;
    //БАНКОМАТ проверяет достаточно ли у него денег;
    //БАНКОМАТ проверяет есть ли у ЧЕЛОВЕКА на СЧЕТУ такая сумма;
    //БАНКОМАТ выдает деньги;
    //обновляет БАНКОВСКИЙ СЧЕТ
    //БАНКОМАТ возвращает КАРТУ
    //БАНКОМАТ обновляет ИСТОРИЮ ТРАНЗАКЦИЙ

    //1. Система должна состоять из слоя репозитория, сервисов и контроллеров
    //2. Использование БД для хранения данных
    //3. Покрытие тестами не менее 80%
    //4. При написании кода используйте java code convention (комментарии, если необходимо, корректные
    // наименования классов, методов и тд, использование CamelCase в наименованиях) и ООП подход
    //5. Система должна иметь API для выполнения функционала




}
